In [45]:
import pandas as pd

In [59]:
dic = {"one":[1,3,5],"two":[2,4,8], "three":[3,6,9]}

df=pd.DataFrame(dic)

### DataFrame에서 임의의 값 선택하기(loc위주)
DataFrame.loc 사용법 탐구

In [60]:
df

   one  two  three
0    1    2      3
1    3    4      6
2    5    8      9

### 1. df에서 0 행만 표시하기

In [61]:
df.loc[0]

one      1
two      2
three    3
Name: 0, dtype: int64

### 2. df에서 0 행 데이터중 one 칼럼의 데이터만 표시하기

In [62]:
df.loc[0,'one']

1

### 3.df에서 0 행과 1번째 행중 one와 two 칼럼의 데이터만 표시하기

In [63]:
df.loc[[0,1],['one','two']]

   one  two
0    1    2
1    3    4

### 4. df의 one열의 값이 3보다 큰 값이 있는 행만 표시하기

In [28]:
df[df['one']>3]

   one  two  three
2    5    8      9

### 번외. df전체에서 5보다 큰 값을 가진 행 찾기가 가능한가?

### 5. 4번의 결과로 나오는 행의 모든 값을 10으로 바꾸기

In [51]:
df.loc[df['one']>3]=10
df

   one  two  three
0    1    2      3
1    3    4      6
2   10   10     10

### 6. three열의 값이 5보다 큰 행에 새로운 열인 four를 만들어 값을 0으로 지정

In [52]:
df.loc[df['three']>5,'four']=0
df

   one  two  three  four
0    1    2      3   NaN
1    3    4      6   0.0
2   10   10     10   0.0

### 7.four열의 값을 1로 전부 변경

In [54]:
df.loc[:,'four']=1
df

   one  two  three  four
0    1    2      3     1
1    3    4      6     1
2   10   10     10     1